Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/dma.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) 2015, Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/
/**
 * \file     dma.h
 *
 * \brief    Direct Memory Access low level access library
 *
 * \version  V0.1.6
 * \date     27. Nov 2018
 *
 *  \note This file violates [MISRA Rule 1], [MISRA Rule 26], [MISRA Rule 45], [MISRA Rule 52], [MISRA Rule 72], [MISRA Rule 85], [MISRA 2012 Rule 12.2, required]
 */
/*******************************************************************************
**                      Author(s) Identity                                    **
********************************************************************************
**                                                                            **
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** DM           Daniel Mysliwitz                                              **
** JO           Julia Ott                                                    **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                      Revision Control History                              **
*******************************************************************************/
/* 
 * V0.1.6: 2018-11-27, JO:   Doxygen update, moved revision history from dma.c to dma.h
 * V0.1.5: 2018-03-12, DM:   DMA Ch13 (SDADC) added
 *                           DMA_MASK_CHx macros changed due to MISRA 2012
 *                           Replaced macros by INLINE functions
 *                           Replaced register accesses within functions by function calls
 *                           Replaced __STATIC_INLINE by INLINE
 *                           Renamed DMA entries according to channel number
 * V0.1.4: 2017-09-22, DM:   MISRA 2012 compliance, the following PC-Lint rules are deactivated:
 *                           Info 793: ANSI/ISO limit of 6 'significant characters in an external identifier
 *                           Note 950: Non-ANSI reserved word or construct: '_to_brackets' [MISRA Rule 1]
 *                           Note 923: cast from unsigned int to pointer [MISRA Rule 45]
 *                           Note 923: cast from pointer to unsigned int [MISRA Rule 45]
 *                           Info 765: Info 765: external '...' could be made static [MISRA Rule 23]
 *                           Error 18: Symbol '...' redeclared (void/nonvoid) ... [MISRA Rule 26], [Encompasses MISRA Rule 72]
 * V0.1.3: 2017-07-20, DM:   API macros added
 * V0.1.2: 2017-07-12, DM:   setup task for scatter-gather added
 * V0.1.1: 2017-07-09, DM:   interrupt macros added, scatter-gather support
 *                           added 
 * V0.1.0: 2015-11-25, DM:   inital version
 */

#ifndef _DMA_H
#define _DMA_H

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
#include "tle987x.h"
#include "types.h"
#include "dma_defines.h"
#include "sfr_access.h"

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/

/*******************************************************************************
**                      Global Macro Definitions                              **
*******************************************************************************/
/**\brief DMA channel selection macro, DMA CH0 */
#define DMA_CH0                       (0u)
/**\brief DMA channel selection macro, DMA CH1 */
#define DMA_CH1                       (1u)
/**\brief DMA channel selection macro, DMA CH2 */
#define DMA_CH2                       (2u)
/**\brief DMA channel selection macro, DMA CH3 */
#define DMA_CH3                       (3u)
/**\brief DMA channel selection macro, DMA CH4 */
#define DMA_CH4                       (4u)
/**\brief DMA channel selection macro, DMA CH5 */
#define DMA_CH5                       (5u)
/**\brief DMA channel selection macro, DMA CH6 */
#define DMA_CH6                       (6u)
/**\brief DMA channel selection macro, DMA CH7 */
#define DMA_CH7                       (7u)
/**\brief DMA channel selection macro, DMA CH8 */
#define DMA_CH8                       (8u)
/**\brief DMA channel selection macro, DMA CH9 */
#define DMA_CH9                       (9u)
/**\brief DMA channel selection macro, DMA CH10 */
#define DMA_CH10                      (10u)
/**\brief DMA channel selection macro, DMA CH11 */
#define DMA_CH11                      (11u)
/**\brief DMA channel selection macro, DMA CH12 */
#define DMA_CH12                      (12u)
/**\brief DMA channel selection macro, DMA CH13, for TLE9879-2QXA40 only */
#define DMA_CH13                      (13u)

