Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/dma.h
/**\brief DMA channel Mask macro, DMA CH0 MASK */
#define DMA_MASK_CH0                  ((uint16)1u << DMA_CH0)
/**\brief DMA channel Mask macro, DMA CH1 MASK */
#define DMA_MASK_CH1                  ((uint16)1u << DMA_CH1)
/**\brief DMA channel Mask macro, DMA CH2 MASK */
#define DMA_MASK_CH2                  ((uint16)1u << DMA_CH2)
/**\brief DMA channel Mask macro, DMA CH3 MASK */
#define DMA_MASK_CH3                  ((uint16)1u << DMA_CH3)
/**\brief DMA channel Mask macro, DMA CH4 MASK */
#define DMA_MASK_CH4                  ((uint16)1u << DMA_CH4)
/**\brief DMA channel Mask macro, DMA CH5 MASK */
#define DMA_MASK_CH5                  ((uint16)1u << DMA_CH5)
/**\brief DMA channel Mask macro, DMA CH6 MASK */
#define DMA_MASK_CH6                  ((uint16)1u << DMA_CH6)
/**\brief DMA channel Mask macro, DMA CH7 MASK */
#define DMA_MASK_CH7                  ((uint16)1u << DMA_CH7)
/**\brief DMA channel Mask macro, DMA CH8 MASK */
#define DMA_MASK_CH8                  ((uint16)1u << DMA_CH8)
/**\brief DMA channel Mask macro, DMA CH9 MASK */
#define DMA_MASK_CH9                  ((uint16)1u << DMA_CH9)
/**\brief DMA channel Mask macro, DMA CH10 MASK */
#define DMA_MASK_CH10                 ((uint16)1u << DMA_CH10)
/**\brief DMA channel Mask macro, DMA CH11 MASK */
#define DMA_MASK_CH11                 ((uint16)1u << DMA_CH11)
/**\brief DMA channel Mask macro, DMA CH12 MASK */
#define DMA_MASK_CH12                 ((uint16)1u << DMA_CH12)
/**\brief DMA channel Mask macro, DMA CH13 MASK,  for TLE9879-2QXA40 only */
#define DMA_MASK_CH13                 ((uint16)1u << DMA_CH13)

/** \enum _TDMA_Transfer_Size
 *  \brief This enum lists the transfer size options for the DMA
 */
typedef enum _TDMA_Transfer_Size
{
  DMA_8Bit_Transfer   = 0u, /**< DMA Transfer Codes macro, 8Bit Transfer  */
  DMA_16Bit_Transfer  = 1u, /**< DMA Transfer Codes macro, 16Bit Transfer */
  DMA_32Bit_Transfer  = 2u  /**< DMA Transfer Codes macro, 32Bit Transfer */
} TDMA_Transfer_Size;

/** \enum _TDMA_Increment_Size
 *  \brief This enum lists the increment size options for the DMA
 */
typedef enum _TDMA_Increment_Size
{
  DMA_Inc_8bit   = 0u, /**< DMA Increment macro, Increment 8Bit  */
  DMA_Inc_16bit  = 1u, /**< DMA Increment macro, Increment 16Bit */
  DMA_Inc_32bit  = 2u  /**< DMA Increment macro, Increment 32Bit */
} TDMA_Increment_Size;

/** \enum _TDMA_Increment_Mode
 *  \brief This enum lists the increment mode options for the DMA
 */
typedef enum _TDMA_Increment_Mode
{
  DMA_No_Inc       = 0u, /**< DMA Increment Codes macro, No Increment */
  DMA_Src_Inc      = 1u, /**< DMA Increment Codes macro, Source Address Increment */
  DMA_Dst_Inc      = 2u, /**< DMA Increment Codes macro, Destination Address Increment */
  DMA_Src_Dst_Inc  = 3u  /**< DMA Increment Codes macro, Source and Destination Address Increment */
} TDMA_Increment_Mode;

/** \enum _TDMA_Cycle_Types
 *  \brief This enum lists the cycle type options for the DMA
 */
typedef enum _TDMA_Cycle_Types
{
  DMA_Cycle_Type_Invalid       = 0u, /**< DMA Cycle Types macro, Invalid Mode */
  DMA_Cycle_Type_Basic         = 1u, /**< DMA Cycle Types macro, Basic Mode */
  DMA_Cycle_Type_Auto          = 2u, /**< DMA Cycle Types macro, Auto-request Mode */
  DMA_Cycle_Type_PingPong      = 3u, /**< DMA Cycle Types macro, PingPong Mode */
  DMA_Cycle_Type_MemSctGthPrim = 4u, /**< DMA Cycle Types macro, Memory scatter/gather Primary Mode */
  DMA_Cycle_Type_MemSctGthAlt  = 5u, /**< DMA Cycle Types macro, Memory scatter/gather Alternate Mode */
  DMA_Cycle_Type_PerSctGthPrim = 6u, /**< DMA Cycle Types macro, Peripheral scatter/gather Primary Mode */
  DMA_Cycle_Type_PerSctGthAlt  = 7u  /**< DMA Cycle Types macro, Peripheral scatter/gather Alternate Mode */
} TDMA_Cycle_Types;

/*******************************************************************************
**                      Global Type Definitions                               **
*******************************************************************************/
/** \struct TControl
 *  \brief This structure lists the bit assignments for the channel_cfg memory location. 
 */
typedef union {
  uint32  reg;
  struct {
    uint32 Cycle_Ctrl: 3;           /**< \brief Bit[2..0] */
    uint32 Next_UseBurst: 1;        /**< \brief Bit[3] */
    uint32 N_Minus_1: 10;           /**< \brief Bit[13..4] */
    uint32 R_Power: 4;              /**< \brief Bit[17..14] */
    uint32 Src_Prot_Ctrl: 3;        /**< \brief Bit[20..18] */
    uint32 Dst_Prot_Ctrl: 3;        /**< \brief Bit[23..21] */
    uint32 Src_Size: 2;             /**< \brief Bit[25..24] */
    uint32 Src_Inc: 2;              /**< \brief Bit[27..26] */
    uint32 Dst_Size: 2;             /**< \brief Bit[29..28] */
    uint32 Dst_Inc: 2;              /**< \brief Bit[31..30] */
  } bit;
} TControl;

/** \struct TDMA_Entry
 *  \brief This structure lists the DMA transfer memory locations. 
 */
typedef struct
{
  uint32 Src_End_Ptr;
  uint32 Dst_End_Ptr;
  TControl Control;
  uint32 reserved;
} TDMA_Entry;


/*******************************************************************************
**                      Global Inline Function Definitions                    **
*******************************************************************************/
/** \brief clears DMA Channel 0 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 0 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH0_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.TRSEQ1DY == (uint8)1)
 *   {
 *     DMA_SQ1_RDY_CALLBACK();
 *     DMA_CH0_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH0_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC2CLR.reg, (uint8)SCU_DMAIRC2CLR_TRSEQ1DYC_Pos, (uint8)SCU_DMAIRC2CLR_TRSEQ1DYC_Msk, 1u);
}

/** \brief clears DMA Channel 1 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 1 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH1_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.TRSEQ2DY == (uint8)1)
 *   {
 *     DMA_SQ2_RDY_CALLBACK();
 *     DMA_CH1_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH1_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC2CLR.reg, (uint8)SCU_DMAIRC2CLR_TRSEQ2DYC_Pos, (uint8)SCU_DMAIRC2CLR_TRSEQ2DYC_Msk, 1u);
}

/** \brief clears DMA Channel 2 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 2 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH2_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SSC1RDY == (uint8)1)
 *   {
 *     DMA_SSC_TX_CALLBACK();
 *     DMA_CH2_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH2_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC2CLR.reg, (uint8)SCU_DMAIRC2CLR_SSC1C_Pos, (uint8)SCU_DMAIRC2CLR_SSC1C_Msk, 1u);
}

