Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/dma.h
/** \brief clears DMA Channel 3 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 3 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH3_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SSC2RDY == (uint8)1)
 *   {
 *     DMA_SSC_RX_CALLBACK();
 *     DMA_CH3_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH3_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC2CLR.reg, (uint8)SCU_DMAIRC2CLR_SSC2C_Pos, (uint8)SCU_DMAIRC2CLR_SSC2C_Msk, 1u);
}

/** \brief clears DMA Channel 4 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 4 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH4_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH1 == (uint8)1)
 *   {
 *     DMA_CH1_CALLBACK();
 *     DMA_CH4_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH4_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH1C_Pos, (uint8)SCU_DMAIRC1CLR_CH1C_Msk, 1u);
}

/** \brief clears DMA Channel 5 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 5 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH5_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH2 == (uint8)1)
 *   {
 *     DMA_CH2_CALLBACK();
 *     DMA_CH5_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH5_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH2C_Pos, (uint8)SCU_DMAIRC1CLR_CH2C_Msk, 1u);
}

/** \brief clears DMA Channel 6 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 6 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH6_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH3 == (uint8)1)
 *   {
 *     DMA_CH3_CALLBACK();
 *     DMA_CH6_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH6_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH3C_Pos, (uint8)SCU_DMAIRC1CLR_CH3C_Msk, 1u);
}

/** \brief clears DMA Channel 7 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 7 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH7_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH4 == (uint8)1)
 *   {
 *     DMA_CH4_CALLBACK();
 *     DMA_CH7_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH7_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH4C_Pos, (uint8)SCU_DMAIRC1CLR_CH4C_Msk, 1u);
}

/** \brief clears DMA Channel 8 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 8 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH8_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH5 == (uint8)1)
 *   {
 *     DMA_CH5_CALLBACK();
 *     DMA_CH8_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH8_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH5C_Pos, (uint8)SCU_DMAIRC1CLR_CH5C_Msk, 1u);
}

/** \brief clears DMA Channel 9 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 9 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH9_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH6 == (uint8)1)
 *   {
 *     DMA_CH6_CALLBACK();
 *     DMA_CH9_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH9_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH6C_Pos, (uint8)SCU_DMAIRC1CLR_CH6C_Msk, 1u);
}

/** \brief clears DMA Channel 10 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 10 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH10_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH7 == (uint8)1)
 *   {
 *     DMA_CH7_CALLBACK();
 *     DMA_CH10_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH10_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH7C_Pos, (uint8)SCU_DMAIRC1CLR_CH7C_Msk, 1u);
}

/** \brief clears DMA Channel 11 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 11 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH11_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH8 == (uint8)1)
 *   {
 *     DMA_CH8_CALLBACK();
 *     DMA_CH11_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH11_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC1CLR.reg, (uint8)SCU_DMAIRC1CLR_CH8C_Pos, (uint8)SCU_DMAIRC1CLR_CH8C_Msk, 1u);
}

/** \brief clears DMA Channel 12 Interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 12 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH12_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.GPT12 == (uint8)1)
 *   {
 *     DMA_GPT12E_CALLBACK();
 *     DMA_CH12_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH12_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC2CLR.reg, (uint8)SCU_DMAIRC2CLR_GPT12C_Pos, (uint8)SCU_DMAIRC2CLR_GPT12C_Msk, 1u);
}

/** \brief clears DMA Channel 13 Interrupt flag.
 * \note for TLE9879-2QXA40 only
 *
 * \brief <b>Example</b><br>
 * \brief This example clears the DMA Channel 13 Interrupt flag when its Status is equal to 1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH13_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SDADC == (uint8)1)
 *   {
 *     DMA_CH13_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH13_Int_Clr(void)
{
  Field_Wrt8(&SCU->DMAIRC2CLR.reg, (uint8)SCU_DMAIRC2CLR_SDADCC_Pos, (uint8)SCU_DMAIRC2CLR_SDADCC_Msk, 1u);
}

/** \brief enables DMA Channel 0 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 0 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH0_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.TRSEQ1DY == (uint8)1)
 *   {
 *     DMA_SQ1_RDY_CALLBACK();
 *     DMA_CH0_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH0_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_TRSEQ1RDYIE_Pos, (uint8)SCU_DMAIEN2_TRSEQ1RDYIE_Msk, 1u);
}

/** \brief disables DMA Channel 0 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 0 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH0_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.TRSEQ1DY == (uint8)1)
 *   {
 *     DMA_SQ1_RDY_CALLBACK();
 *     DMA_CH0_Int_Clr();
 *   }
 *   DMA_CH0_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH0_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_TRSEQ1RDYIE_Pos, (uint8)SCU_DMAIEN2_TRSEQ1RDYIE_Msk, 0u);
}

/** \brief enables DMA Channel 1 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 1 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH1_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.TRSEQ2DY == (uint8)1)
 *   {
 *     DMA_SQ2_RDY_CALLBACK();
 *     DMA_CH1_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH1_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_TRSEQ2RDYIE_Pos, (uint8)SCU_DMAIEN2_TRSEQ2RDYIE_Msk, 1u);
}

/** \brief disables DMA Channel 1 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 1 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH1_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.TRSEQ2DY == (uint8)1)
 *   {
 *     DMA_SQ2_RDY_CALLBACK();
 *     DMA_CH1_Int_Clr();
 *   }
 *   DMA_CH1_Int_Dis(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH1_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_TRSEQ2RDYIE_Pos, (uint8)SCU_DMAIEN2_TRSEQ2RDYIE_Msk, 0u);
}

/** \brief enables DMA Channel 2 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 2 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH2_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SSC1RDY == (uint8)1)
 *   {
 *     DMA_SSC_TX_CALLBACK();
 *     DMA_CH2_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH2_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_SSCTXIE_Pos, (uint8)SCU_DMAIEN2_SSCTXIE_Msk, 1u);
}

/** \brief disables DMA Channel 2 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 2 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH2_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SSC1RDY == (uint8)1)
 *   {
 *     DMA_SSC_TX_CALLBACK();
 *     DMA_CH2_Int_Clr();
 *   }
 *   DMA_CH2_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH2_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_SSCTXIE_Pos, (uint8)SCU_DMAIEN2_SSCTXIE_Msk, 0u);
}

/** \brief enables DMA Channel 3 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 3 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH3_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SSC2RDY == (uint8)1)
 *   {
 *     DMA_SSC_RX_CALLBACK();
 *     DMA_CH3_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH3_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_SSCRXIE_Pos, (uint8)SCU_DMAIEN2_SSCRXIE_Msk, 1u);
}

/** \brief disables DMA Channel 3 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 3 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH3_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SSC2RDY == (uint8)1)
 *   {
 *     DMA_SSC_RX_CALLBACK();
 *     DMA_CH3_Int_Clr();
 *   }
 *   DMA_CH3_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH3_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_SSCRXIE_Pos, (uint8)SCU_DMAIEN2_SSCRXIE_Msk, 0u);
}

/** \brief enables DMA Channel 4 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 4 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH4_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH1 == (uint8)1)
 *   {
 *     DMA_CH1_CALLBACK();
 *     DMA_CH4_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH4_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH1IE_Pos, (uint8)SCU_DMAIEN1_CH1IE_Msk, 1u);
}

/** \brief disables DMA Channel 4 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 4 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH4_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH1 == (uint8)1)
 *   {
 *     DMA_CH1_CALLBACK();
 *     DMA_CH4_Int_Clr();
 *   }
 *   DMA_CH4_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH4_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH1IE_Pos, (uint8)SCU_DMAIEN1_CH1IE_Msk, 0u);
}

/** \brief enables DMA Channel 5 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 5 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH5_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH2 == (uint8)1)
 *   {
 *     DMA_CH2_CALLBACK();
 *     DMA_CH5_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH5_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH2IE_Pos, (uint8)SCU_DMAIEN1_CH2IE_Msk, 1u);
}

/** \brief disables DMA Channel 5 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 5 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH5_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH2 == (uint8)1)
 *   {
 *     DMA_CH2_CALLBACK();
 *     DMA_CH5_Int_Clr();
 *   }
 *   DMA_CH5_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH5_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH2IE_Pos, (uint8)SCU_DMAIEN1_CH2IE_Msk, 0u);
}

/** \brief enables DMA Channel 6 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 6 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH6_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH3 == (uint8)1)
 *   {
 *     DMA_CH3_CALLBACK();
 *     DMA_CH6_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH6_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH3IE_Pos, (uint8)SCU_DMAIEN1_CH3IE_Msk, 1u);
}

/** \brief disables DMA Channel 6 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 6 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH6_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH3 == (uint8)1)
 *   {
 *     DMA_CH3_CALLBACK();
 *     DMA_CH6_Int_Clr();
 *   }
 *   DMA_CH6_Int_Dis(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH6_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH3IE_Pos, (uint8)SCU_DMAIEN1_CH3IE_Msk, 0u);
}

/** \brief enables DMA Channel 7 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 7 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH7_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH4 == (uint8)1)
 *   {
 *     DMA_CH4_CALLBACK();
 *     DMA_CH7_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH7_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH4IE_Pos, (uint8)SCU_DMAIEN1_CH4IE_Msk, 1u);
}

/** \brief disables DMA Channel 7 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 7 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH7_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH4 == (uint8)1)
 *   {
 *     DMA_CH4_CALLBACK();
 *     DMA_CH7_Int_Clr();
 *   }
 *   DMA_CH7_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH7_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH4IE_Pos, (uint8)SCU_DMAIEN1_CH4IE_Msk, 0u);
}

