Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/dma.h
/** \brief enables DMA Channel 8 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 8 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH8_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH5 == (uint8)1)
 *   {
 *     DMA_CH5_CALLBACK();
 *     DMA_CH8_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH8_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH5IE_Pos, (uint8)SCU_DMAIEN1_CH5IE_Msk, 1u);
}

/** \brief disables DMA Channel 8 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 8 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH8_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH5 == (uint8)1)
 *   {
 *     DMA_CH5_CALLBACK();
 *     DMA_CH8_Int_Clr();
 *   }
 *   DMA_CH8_Int_Dis(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH8_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH5IE_Pos, (uint8)SCU_DMAIEN1_CH5IE_Msk, 0u);
}

/** \brief enables DMA Channel 9 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 9 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH9_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH6 == (uint8)1)
 *   {
 *     DMA_CH6_CALLBACK();
 *     DMA_CH9_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH9_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH6IE_Pos, (uint8)SCU_DMAIEN1_CH6IE_Msk, 1u);
}

/** \brief disables DMA Channel 9 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 9 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH9_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH6 == (uint8)1)
 *   {
 *     DMA_CH6_CALLBACK();
 *     DMA_CH9_Int_Clr();
 *   }
 *   DMA_CH9_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH9_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH6IE_Pos, (uint8)SCU_DMAIEN1_CH6IE_Msk, 0u);
}

/** \brief enables DMA Channel 10 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 10 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH10_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH7 == (uint8)1)
 *   {
 *     DMA_CH7_CALLBACK();
 *     DMA_CH10_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH10_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH7IE_Pos, (uint8)SCU_DMAIEN1_CH7IE_Msk, 1u);
}

/** \brief disables DMA Channel 10 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 10 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH10_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH7 == (uint8)1)
 *   {
 *     DMA_CH7_CALLBACK();
 *     DMA_CH10_Int_Clr();
 *   }
 *   DMA_CH10_Int_Dis(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH10_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH7IE_Pos, (uint8)SCU_DMAIEN1_CH7IE_Msk, 0u);
}

/** \brief enables DMA Channel 11 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 11 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH11_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH8 == (uint8)1)
 *   {
 *     DMA_CH8_CALLBACK();
 *     DMA_CH11_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH11_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH8IE_Pos, (uint8)SCU_DMAIEN1_CH8IE_Msk, 1u);
}

/** \brief disables DMA Channel 11 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 11 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH11_Int_En(); 
 *   if ((uint8)SCU->DMAIRC1.bit.CH8 == (uint8)1)
 *   {
 *     DMA_CH8_CALLBACK();
 *     DMA_CH11_Int_Clr();
 *   }
 *   DMA_CH11_Int_Dis(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH11_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN1.reg, (uint8)SCU_DMAIEN1_CH8IE_Pos, (uint8)SCU_DMAIEN1_CH8IE_Msk, 0u);
}

/** \brief enables DMA Channel 12 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 12 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH12_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.GPT12 == (uint8)1)
 *   {
 *     DMA_GPT12E_CALLBACK();
 *     DMA_CH12_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH12_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_GPT12IE_Pos, (uint8)SCU_DMAIEN2_GPT12IE_Msk, 1u);
}

/** \brief disables DMA Channel 12 Interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the DMA Channel 12 Interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH12_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.GPT12 == (uint8)1)
 *   {
 *     DMA_GPT12E_CALLBACK();
 *     DMA_CH12_Int_Clr();
 *   }
 *   DMA_CH12_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH12_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_GPT12IE_Pos, (uint8)SCU_DMAIEN2_GPT12IE_Msk, 0u);
}

/** \brief enables DMA Channel 13 Interrupt.
 * \note for TLE9879-2QXA40 only
 *
 * \brief <b>Example</b><br>
 * \brief This example clears the DMA Channel 13 Interrupt flag when its Status is equal to 1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH13_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SDADC == (uint8)1)
 *   {
 *     DMA_CH13_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH13_Int_En(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_SDADCIE_Pos, (uint8)SCU_DMAIEN2_SDADCIE_Msk, 1u);
}

/** \brief disables DMA Channel 13 Interrupt.
 * \note for TLE9879-2QXA40 only
 *
 * \brief <b>Example</b><br>
 * \brief This example clears the DMA Channel 13 Interrupt flag when its Status is equal to 1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_CH13_Int_En(); 
 *   if ((uint8)SCU->DMAIRC2.bit.SDADC == (uint8)1)
 *   {
 *     DMA_CH13_Int_Clr();
 *   }
 *   DMA_CH13_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_CH13_Int_Dis(void)
{
  Field_Mod8(&SCU->DMAIEN2.reg, (uint8)SCU_DMAIEN2_SDADCIE_Pos, (uint8)SCU_DMAIEN2_SDADCIE_Msk, 0u);
}

/** \brief points to the base address of the primary data structure.
 *
 * \param mask_ch DMA channel Mask
 *
 * \brief <b>Example</b><br>
 * \brief This example points to the base address of Channel 0.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_Master_En();
 *   DMA_Primary_Struct_Set(DMA_MASK_CH0); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_Primary_Struct_Set(uint32 mask_ch)
{
  Field_Mod32(&DMA->CTRL_BASE_PTR.reg, DMA_CTRL_BASE_PTR_CTRL_BASE_PTR_Pos, DMA_CTRL_BASE_PTR_CTRL_BASE_PTR_Msk, mask_ch);
}

/** \brief enables DMA Channels.
 *
 * \param mask_ch DMA channel Mask
 *
 * \brief <b>Example</b><br>
 * \brief This example enables DMA Channel 0.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_Master_En();
 *   DMA_Channel_Enable_Set(DMA_MASK_CH0); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_Channel_Enable_Set(uint32 mask_ch)
{
  Field_Mod32(&DMA->CHNL_ENABLE_SET.reg, DMA_CHNL_ENABLE_SET_CHNL_ENABLE_SET_Pos, DMA_CHNL_ENABLE_SET_CHNL_ENABLE_SET_Msk, mask_ch);
}

/** \brief Set software request for DMA Channels.
 *
 * \param mask_ch DMA channel Mask
 *
 * \brief <b>Example</b><br>
 * \brief This example enables DMA Channel 0.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_Master_En();
 *   DMA_Software_Request_Set(DMA_MASK_CH0); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_Software_Request_Set(uint32 mask_ch)
{
  Field_Mod32(&DMA->CHNL_SW_REQUEST.reg, DMA_CHNL_SW_REQUEST_CHNL_SW_REQUEST_Pos, DMA_CHNL_SW_REQUEST_CHNL_SW_REQUEST_Msk, mask_ch);
}

/** \brief selects the primary data structure for the corresponding DMA channel.
 *
 * \param mask_ch DMA channel Mask
 *
 * \brief <b>Example</b><br>
 * \brief This example selects the primary data structure for DMA channel 0.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_Master_En();
 *   DMA_Primary_Struct_Usage_Set(DMA_MASK_CH0); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_Primary_Struct_Usage_Set(uint32 mask_ch)
{
  Field_Mod32(&DMA->CHNL_PRI_ALT_CLR.reg, DMA_CHNL_PRI_ALT_CLR_CHNL_PRI_ALT_CLR_Pos, DMA_CHNL_PRI_ALT_CLR_CHNL_PRI_ALT_CLR_Msk, mask_ch);
}

/** \brief selects the alternate data structure for the corresponding DMA channel.
 *
 * \param mask_ch DMA channel Mask
 *
 * \brief <b>Example</b><br>
 * \brief This example selects the alternate data structure for DMA channel 0.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   DMA_Master_En();
 *   DMA_Alternate_Struct_Usage_Set(DMA_MASK_CH0); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_Alternate_Struct_Usage_Set(uint32 mask_ch)
{
  Field_Mod32(&DMA->CHNL_PRI_ALT_SET.reg, DMA_CHNL_PRI_ALT_SET_CHNL_PRI_ALT_SET_Pos, DMA_CHNL_PRI_ALT_SET_CHNL_PRI_ALT_SET_Msk, mask_ch);
}

/** \brief This function returns the address inside the alternate structure in RAM for a given DMA channel.
 *
 * \param DMA_Ch DMA channel number
 * \return uint32 32bit address to entry inside alternate structure
 *
 * \ingroup dma_api
 */
INLINE uint32 DMA_CHx_Entry_Alt(uint8 DMA_Ch) 
{
  return( (uint32)(DMA->ALT_CTRL_BASE_PTR.reg + (DMA_Ch * sizeof(TDMA_Entry))) );
}

/** \brief This function returns the address inside the primary structure in RAM for a given DMA channel.
 *
 * \param DMA_Ch DMA channel number
 * \return uint32 32bit address to entry inside primary structure
 *
 * \ingroup dma_api
 */
INLINE uint32 DMA_CHx_Entry_Pri(uint8 DMA_Ch)
{
  return( (uint32)(DMA->CTRL_BASE_PTR.reg + (DMA_Ch * sizeof(TDMA_Entry))) );
}

