Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/dma.h
/*******************************************************************************
**                      Global Variable Declarations                          **
*******************************************************************************/

/*******************************************************************************
**                      Global Function Declarations                          **
*******************************************************************************/
#if (DMA_XML_VERSION >= 10200)

/** \brief Initializes the DMA structure in RAM and SFRs according to the ConfigWizard settings.
 *  \note This function violates [MISRA Rule 45], [MISRA Rule 52], [MISRA Rule 85]
 * \ingroup dma_api
 */
void DMA_Init(void);

/** \brief Sets up the desired DMA channel in the primary structure in RAM.
 *  \note This function violates [MISRA Rule 45]
 *
 * \param DMA_ChIdx DMA channel to be set up
 * \param addr_src address pointing to the source location
 * \param addr_dst address pointing to the destination location
 * \param trans_cnt number of transfers
 * \param datawidth data width for each transfer, see \link TDMA_Transfer_Size \endlink
 * \param increment incrementing scheme used for the transfer, see \link TDMA_Increment_Mode \endlink
 *
 * \brief <b>Example</b><br>
 * \brief This example transfers the result of ADC1.Ch4 into a local variable once the ADC1.Ch4 conversion is done.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   uint16 adc_val;
 *   
 *   //setup DMA channel 8 to transfer ADC1.Ch4 result into local variable
 *   DMA_Setup_Channel(DMA_CH8, (uint32)&ADC1->RES_OUT4.reg, (uint32)&adc_val, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 * 
 *   //arm DMA channel 8
 *   DMA_Channel_Enable_Set(DMA_MASK_CH8);
 *   
 *   //enable DMA
 *   DMA_Master_En();
 *   
 *   //start ADC1.Ch4 conversion
 *   ADC1_SetSocSwMode(ADC1_CH4);
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
void DMA_Setup_Channel(uint32 DMA_ChIdx, uint32 addr_src, uint32 addr_dst, 
                       uint32 trans_cnt, TDMA_Transfer_Size datawidth, TDMA_Increment_Mode increment);


/** \brief Resets the primary structure in RAM for a given channel and rearms it.
 *  \note This function violates [MISRA Rule 45]
 *
 * \param DMA_ChIdx DMA channel to be set up
 * \param trans_cnt number of transfers
 *
 * \brief <b>Example</b><br>
 * \brief This example transfers the result of ADC1.Ch4 into a local variable, inside the interrupt service callback the DMA channel 8 gets reset.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   uint16 adc_val;
 *   
 *   //setup DMA channel 8 to transfer ADC1.Ch4 result into local variable
 *   DMA_Setup_Channel(DMA_CH8, (uint32)&ADC1->RES_OUT4.reg, (uint32)&adc_val, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 * 
 *   //arm DMA channel 8
 *   DMA_Channel_Enable_Set(DMA_MASK_CH8);
 *   
 *   //enable DMA
 *   DMA_Master_En();
 *   
 *   //start ADC1.Ch4 conversion
 *   ADC1_SetSocSwMode(ADC1_CH4);
 * }
 *
 * void DMA_Ch8_ISR(void)
 * {
 *   //reset channel parameter and rearm channel
 *   DMA_Reset_Channel(DMA_CH8, 1);
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
void DMA_Reset_Channel(uint32 DMA_ChIdx, uint32 trans_cnt);

/** \brief Sets up a task to be used with memory scatter-gather mode.
 * \brief The DMA scather-gather mode can be used to perform multiple but different DMA transfers initiated with one trigger.
 * \brief The last task can be used to self-arm this scatter-gather transfer again.
 * \brief This function can be used to define the last, self-arming task for the scather-gather mode.
 *
 * \param entry pointer to the task
 * \param DMA_Ch the DMA channel for with the task is setup
 * \param Task_List pointer to the task list to be executed with this DMA transfer
 * \param NoOfTask number of tasks defined in the task list
 *
 * \return pointer to the task
 *
 * \brief <b>Example</b><br>
 * \brief This example performs an endless scatter-gather transfer and toggles P0.1.
 * ~~~~~~~~~~~~~~~{.c}
 * #define no_of_tasks 4+1
 * TDMA_Entry MainTask_Ch0;
 * TDMA_Entry Tasks_Ch0[no_of_tasks];
 * uint8 lport_p01_high = 2;
 * uint8 lport_p01_low  = 0;
 *
 * void Example_Function(void)
 * {
 *   //initializes the primary structure task (MainTask_Ch0) to be used to reset the scatter-gather sequence
 *   DMA_Task_SctGth_Set(&MainTask_Ch0, DMA_CH0, &Tasks_Ch0[0], DMA_CH0_TASK_NoOfTasks);
 *   //initializes the task list 0
 *   //tasks[3..0] are the tasks actually doing some real work, here causing P0.1 to toggle
 *   DMA_Task_Set(&Tasks_Ch0[0], DMA_Cycle_Type_MemSctGthAlt, 0, (uint32)&lport_p01_high, (uint32)&PORT->P0_DATA.reg,         1, DMA_8Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&Tasks_Ch0[1], DMA_Cycle_Type_MemSctGthAlt, 0, (uint32)&lport_p01_low,  (uint32)&PORT->P0_DATA.reg,         1, DMA_8Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&Tasks_Ch0[2], DMA_Cycle_Type_MemSctGthAlt, 0, (uint32)&lport_p01_high, (uint32)&PORT->P0_DATA.reg,         1, DMA_8Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&Tasks_Ch0[3], DMA_Cycle_Type_MemSctGthAlt, 0, (uint32)&lport_p01_low,  (uint32)&PORT->P0_DATA.reg,         1, DMA_8Bit_Transfer, DMA_No_Inc);
 *   //tasks[4] are used to reset Channel1, the fast that the last task is NOT of type 'DMA_Cycle_Type_Basic' keeps the scatter-gather running for ever
 *   DMA_Task_Set(&Tasks_Ch0[4], DMA_Cycle_Type_MemSctGthAlt, 2, (uint32)&MainTask_Ch0,   ui32_DMA_CHx_Entry_Pri(DMA_CH0),    4, DMA_32Bit_Transfer, DMA_Src_Dst_Inc);
 *   //preloads the primary structure with the task list for Channel0
 *   DMA_Channel_MemSctGth_Set(DMA_CH0, &Tasks_Ch0[0], DMA_CH0_TASK_NoOfTasks);
 *   //enable DMA Channel0
 *   DMA_Channel_Enable_Set(DMA_MASK_CH0);
 *   //enable DMA master
 *   DMA_Master_En();
 *   //trigger DMA Channel0 by software
 *   DMA_Software_Request_Set(DMA_MASK_CH0);
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup drv_api
 */
TDMA_Entry* DMA_Task_SctGth_Set(TDMA_Entry* entry, uint8 DMA_Ch, TDMA_Entry* Task_List, uint32 NoOfTask);

/** \brief Sets up a channel to operate in Memory Scatter-Gather mode on a given task list.
 *  \note This function violates [MISRA Rule 45]
 *
 * \param DMA_ChIdx DMA channel to be set up
 * \param Task_List points to the task structure defined in RAM, see \link DMA_Task_Set \endlink
 * \param NoOfTasks number of tasks in the Task_List
 *
 * \brief <b>Example</b><br>
 * \brief This example transfers the result of ADC1.Ch4 into a local variable once the ADC1.Ch4 conversion is done.
 * ~~~~~~~~~~~~~~~{.c}
 * #define no_of_tasks 2
 * TDMA_Entry tasks[no_of_tasks];
 * static uint32 data0, data1;
 * static uint32 data2, data3;
 *
 * void Example_Function(void)
 * {
 *   // tasks[0] copies data0 to data1
 *   data0 = 0x12345678;
 *   data1 = 0;
 *   // tasks[1] copies data2 to data3
 *   data2 = 0xABCD;
 *   data3 = 0;
 *          
 *   DMA_Task_Set(&tasks[0], DMA_Cycle_Type_MemSctGthAlt, 0, (uint32)&data0, (uint32)&data1, 1, DMA_32Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&tasks[1], DMA_Cycle_Type_Basic,        0, (uint32)&data2, (uint32)&data3, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   
 *   DMA_Channel_MemSctGth_Set(DMA_CH8, &tasks[0], no_of_tasks);
 *   
 *   //arm DMA channel 8
 *   DMA_Channel_Enable_Set(DMA_MASK_CH8);
 * 
 *   //enable DMA
 *   DMA_Master_En();
 *   
 *   ADC1_SetSocSwMode(ADC1_CH4);
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
void DMA_Channel_MemSctGth_Set(uint32 DMA_ChIdx, TDMA_Entry* Task_List, uint32 NoOfTasks);


/** \brief Sets up a channel to operate in Peripheral Scatter-Gather mode on a given task list.
 *  \note This function violates [MISRA Rule 45]
 *
 * \param DMA_ChIdx DMA channel to be set up
 * \param Task_List points to the task structure defined in RAM, see \link DMA_Task_Set \endlink
 * \param NoOfTasks number of tasks in the Task_List
 *
 * \brief <b>Example</b><br>
 * \brief This example transfers the four SPI values from RAM to SSC1.
 * ~~~~~~~~~~~~~~~{.c}
 * #define no_of_tasks 4
 * TDMA_Entry tasks[no_of_tasks];
 * #define no_of_spi_trans 4
 * uint16 spi_data[no_of_spi_trans] = {0xAAAA, 0x5555, 0xCCCC, 0x3333};
 *
 * void Example_Function(void)
 * {
 *   //setup tasks for SPI transfer
 *   DMA_Task_Set(&tasks[0], DMA_Cycle_Type_PerSctGthAlt, 0, (uint32)&spi_data[0], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&tasks[1], DMA_Cycle_Type_PerSctGthAlt, 0, (uint32)&spi_data[1], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&tasks[2], DMA_Cycle_Type_PerSctGthAlt, 0, (uint32)&spi_data[2], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&tasks[3], DMA_Cycle_Type_Basic,        0, (uint32)&spi_data[3], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   
 *   //initialize DMA.Ch2 to tasks list
 *   DMA_Channel_PerSctGth_Set(DMA_CH2, &tasks[0], no_of_tasks);
 *   
 *   //arm DMA channel 2
 *   DMA_Channel_Enable_Set(DMA_MASK_CH2);
 * 
 *   //enable DMA
 *   DMA_Master_En();
 *   
 *   //trigger DMA.Ch2 by software request
 *   DMA_Software_Request_Set(DMA_MASK_CH2);
 * } 
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
void DMA_Channel_PerSctGth_Set(uint32 DMA_ChIdx, TDMA_Entry* Task_List, uint32 NoOfTasks);

