Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/dma.h
/** \brief Sets up a task to be used in the Scatter-Gather modes.
 *
 * \param entry pointer to the task structure \link TDMA_Entry \endlink
 * \param cycle_type defines the type of DMA transfer to be performed, see \link TDMA_Cycle_Types \endlink
 * \param arb_rate arbitration rate, defines after how many DMA transfer it rearbitrates, 2^arb_rate
 * \param addr_src address pointing to the source location
 * \param addr_dst address pointing to the destination location
 * \param trans_cnt number of transfers
 * \param datawidth data width for each transfer, see \link TDMA_Transfer_Size \endlink
 * \param increment incrementing scheme used for the transfer, see \link TDMA_Increment_Mode \endlink
 *
 * \brief <b>Example</b><br>
 * \brief This example transfers the four SPI values from RAM to SSC1.
 * ~~~~~~~~~~~~~~~{.c}
 * #define no_of_tasks 4
 * TDMA_Entry tasks[no_of_tasks];
 * #define no_of_spi_trans 4
 * uint16 spi_data[no_of_spi_trans] = {0xAAAA, 0x5555, 0xCCCC, 0x3333};
 *
 * void Example_Function(void)
 * {
 *   //setup tasks for SPI transfer
 *   DMA_Task_Set(&tasks[0], DMA_Cycle_Type_PerSctGthAlt, 0, (uint32)&spi_data[0], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&tasks[1], DMA_Cycle_Type_PerSctGthAlt, 0, (uint32)&spi_data[1], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&tasks[2], DMA_Cycle_Type_PerSctGthAlt, 0, (uint32)&spi_data[2], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   DMA_Task_Set(&tasks[3], DMA_Cycle_Type_Basic,        0, (uint32)&spi_data[3], (uint32)&SSC1->TB.reg, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 *   
 *   //initialize DMA.Ch2 to tasks list
 *   DMA_Channel_PerSctGth_Set(DMA_CH2, &tasks[0], no_of_tasks);
 *   
 *   //arm DMA channel 2
 *   DMA_Channel_Enable_Set(DMA_MASK_CH2);
 * 
 *   //enable DMA
 *   DMA_Master_En();
 *   
 *   //trigger DMA.Ch2 by software request
 *   DMA_Software_Request_Set(DMA_MASK_CH2);
 * } 
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
TDMA_Entry* DMA_Task_Set(TDMA_Entry* entry, TDMA_Cycle_Types cycle_type, uint8 arb_rate, uint32 addr_src, uint32 addr_dst, 
                         uint32 trans_cnt, TDMA_Transfer_Size datawidth, TDMA_Increment_Mode increment);

/** \brief Enabled the DMA master.
 *
 * \brief <b>Example</b><br>
 * \brief This example transfers the result of ADC1.Ch4 into a local variable once the ADC1.Ch4 conversion is done.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   uint16 adc_val;
 *   
 *   //setup DMA channel 8 to transfer ADC1.Ch4 result into local variable
 *   DMA_Setup_Channel(DMA_CH8, (uint32)&ADC1->RES_OUT4.reg, (uint32)&adc_val, 1, DMA_16Bit_Transfer, DMA_No_Inc);
 * 
 *   //arm DMA channel 8
 *   DMA_Channel_Enable_Set(DMA_MASK_CH8);
 *   
 *   //enable DMA
 *   DMA_Master_En();
 *   
 *   //start ADC1.Ch4 conversion
 *   ADC1_SetSocSwMode(ADC1_CH4);
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup dma_api
 */
INLINE void DMA_Master_En(void);

/*******************************************************************************
**                      Global INLINE Function Definitions                    **
*******************************************************************************/
INLINE void DMA_Master_En(void)
{
  /* arm the DMA */
  DMA->CFG.bit.MASTER_ENABLE = 1u;
}
#else
  #error "use IFXConfigWizard XML Version V1.2.0 or greater"
#endif

#endif
